import java.util.ArrayList;
import java.util.HashMap;

public class User {
	//本次為User說話即可呼叫此class，並且執行Robot回應
	public static String[] UserSelect(String type) {
		if (type.contains("回覆")) {
			return	UserReply(type);
		} else {
			return	UserQuestion(type);
		}
	}

	private static String[] UserReply(String type) {
		String Reply[] = new String[3];
		Reply[2] = "Robot";
		switch (type) {
		case "回覆交通資訊":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};			
			break;
		case "回覆行程":
			String[] array={"問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆住宿資訊":
			String[] array={"問行程","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆店家資訊":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆活動":
			String[] array={"問行程","問住家資訊","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆食物":
			String[] array={"問行程","問住家資訊","問活動","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			String ReplyType = "問食物";
			Reply[0] = RobotReply.getRandomQuestion(ReplyType);
			Reply[1] = ReplyType;
		case "回覆食物資訊":
			String[] array={"問行程","問住家資訊","問活動","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆旅遊方式":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆旅遊同伴":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆旅遊時間":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆旅遊理由":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆開放時間":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆票卷資訊":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		case "回覆景點":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問距離","問感受"};
			break;
		case "回覆感覺":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離"};
			break;
		case "回覆價位":
			String[] array={"問行程","問住家資訊","問活動","問食物","問旅遊方式","問旅遊同伴","問旅遊時間","問旅遊理由","問旅遊費用","問旅遊準備情形","問旅遊購買資訊","問特色","問景點","問距離","問感受"};
			break;
		}
		
		return Reply;
	}

	private static String[] UserQuestion(String type) {
		String Reply[] = new String[3];
		Reply[2] = "Robot";
		switch (type) {
		case "問地點":
			String[] array={"回覆地點"};
			break;
		case "問地址":
			String[] array={"回覆店家資訊"};
			break;
		case "問食物":
			String[] array={"回覆食物"};
			Reply[0] = RobotReply.getRandomAnswer(type);
			Reply[1] = type;
			break;
		case "問景點":
			String[] array={"回覆景點"};
			break;
		case "問景點資訊":
			String[] array={"回覆景點資訊"};
			break;
		case "問開放時間":
			String[] array={"回覆開放時間"};
			break;
		}
		
		return Reply;
	}
}
